<a href="https://colab.research.google.com/github/Mijewljose/Mijewljose/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
x = ["a", "m", "l", "p", "k", "p"]
x1 = pd.DataFrame(x, columns=['Alphabets'])
x2 = x1.head(2)

In [ ]:
print(x2)

  Alphabets
0         a
1         m

In [ ]:
y = {'Length': [15, 13, 18, 40, 22]}
y1 = pd.DataFrame(y)

In [ ]:
print(y1)

   Length
0      15
1      13
2      18
3      40
4      22

In [ ]:
print(y1.describe())

          Length
count   5.000000
mean   21.600000
std    10.830512
min    13.000000
25%    15.000000
50%    18.000000
75%    22.000000
max    40.000000

In [ ]:
print(y1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Length  5 non-null      int64
dtypes: int64(1)
memory usage: 168.0 bytes
None

In [ ]:
import pandas as pd

In [ ]:
data = {'Name': ['Mijewel', 'Milan', 'Miya', 'Mini'],
        'Age': [21, "NaN", 18, 45],
        'Gender': ['Male', 'Male', 'Female', 'Female'],
        'Salary': [50000, 35000, 45000, 70000]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df.to_csv('mydataset.csv', index=False)

In [ ]:
print(df.head())

      Name  Age  Gender  Salary
0  Mijewel   21    Male   50000
1    Milan  NaN    Male   35000
2     Miya   18  Female   45000
3     Mini   45  Female   70000

In [ ]:
print(df.info())
print(df.describe())
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      object
 2   Gender  4 non-null      object
 3   Salary  4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes
None
             Salary
count      4.000000
mean   50000.000000
std    14719.601444
min    35000.000000
25%    42500.000000
50%    47500.000000
75%    55000.000000
max    70000.000000
(4, 4)

In [ ]:
print(df.isnull().sum())
print(df.dtypes)

Name      0
Age       0
Gender    0
Salary    0
dtype: int64
Name      object
Age       object
Gender    object
Salary     int64
dtype: object

In [ ]:
df['Age'].fillna('NaN', inplace=True)

In [ ]:

print(df)

      Name  Age  Gender  Salary
0  Mijewel   21    Male   50000
1    Milan  NaN    Male   35000
2     Miya   18  Female   45000
3     Mini   45  Female   75000

In [ ]:
x1 = 75000
df.loc[df['Salary'] > 60000, 'Salary'] = x1

In [ ]:
print(df)

      Name  Age  Gender  Salary
0  Mijewel   21    Male   50000
1    Milan  NaN    Male   35000
2     Miya   18  Female   45000
3     Mini   45  Female   75000

In [ ]:
print(df.duplicated().sum())
print(df[df.duplicated()])

0
Empty DataFrame
Columns: [Name, Age, Gender, Salary]
Index: []

In [ ]:
df.to_csv('my1dataset.csv', index=False)

In [ ]:
print(df)

      Name  Age  Gender  Salary
0  Mijewel   21    Male   50000
1    Milan  NaN    Male   35000
2     Miya   18  Female   45000
3     Mini   45  Female   75000